app/controllers/albums_controller.rb

SELECT  1 AS one FROM "albums" LIMIT $1  [["LIMIT", 1]]
SELECT "albums".* FROM "albums"
---
  def index
    if Album.all.empty?
      render json: Album.all, status: :ok
    else
      @albums = Album.all.map{|c| c.index(request.host)}

SELECT  "albums".* FROM "albums" WHERE "albums"."ealbum" = $1 LIMIT $2  [["ealbum", "Z3JlYXRlc3QgaGl0cw=="], ["LIMIT", 1]]
---
  def show
    name = params[:ealbum]
    @album = Album.find_by ealbum: name

SELECT  "artists".* FROM "artists" WHERE "artists"."eartist" = $1 LIMIT $2  [["eartist", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."name" = $1 LIMIT $2  [["name", "rememdo"], ["LIMIT", 1]]
INSERT INTO "albums" ("ealbum", "artist_id", "name", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ealbum", "cmVtZW1kbw=="], ["artist_id", 1], ["name", "rememdo"], ["genre", "good"], ["created_at", "2021-04-29 20:29:29.437281"], ["updated_at", "2021-04-29 20:29:29.437281"]]
---
  def create

    if (params[:album].key?("name")) && (params[:album].key?("genre"))
      name = params[:album]["name"]
      genre = params[:album]["genre"]
      if name.is_a?(String) && genre.is_a?(String)
        artist_name = params[:eartist]
        artist = Artist.find_by eartist: artist_name
        if artist.nil?
          render json: "Error no existe artista", status: :unprocessable_entity
        else
          album_params = params.require(:album).permit(:name, :genre)
          album_params[:artist_id] = artist.id
          album = Album.new(album_params)
          album.encodealbum
          album_exists = Album.find_by name: album.name
          if album_exists.nil?
            if album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."ealbum" = $1 LIMIT $2  [["ealbum", "Z2FuZ3N0ZXJz"], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 3]]
SELECT  1 AS one FROM "tracks" WHERE "tracks"."album_id" = $1 LIMIT $2  [["album_id", 2], ["LIMIT", 1]]
---
  def album_tracks
    name = params[:ealbum]
    album = Album.find_by ealbum: name
    if album.nil?
      render json: "Not found", status: :not_found
    else
      if album.tracks.empty?
        render json: "", status: :ok
      else
        render json: album.tracks.map{|c| c.index(request.host)}, status: :ok

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 3]]
---
  def album_play
    name = params[:ealbum]
    album = Album.find_by ealbum: name
    if album.nil?
      render json: "Not found", status: :not_found
    else
      if album.tracks.nil?
        render json: "", status: :ok
      else
        album.tracks.map{|c| c.play}
        render json: album.tracks.map{|c| c.index(request.host)}, status: :ok

SELECT  "albums".* FROM "albums" WHERE "albums"."ealbum" = $1 LIMIT $2  [["ealbum", "MSBhbGJ1bQ=="], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]
---
  def delete
    name = params[:ealbum]
    @album = Album.find_by ealbum: name
    if @album.nil?
      render json: "No existe", status: :not_found
    else
      @album.destroy