app/controllers/artists_controller.rb

  def create
    @artist_params = params.require(:artist).permit(:name, :age)
    @artist = Artist.new(@artist_params)
    @artist.encodeartist


    if @artist.valid?
      artist_exists = Artist.find_by name: @artist.name
      if artist_exists.nil?
        if @artist.save
---
INSERT INTO "artists" ("eartist", "name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["eartist", "Q2FybG9z\n"], ["name", "Carlos"], ["age", 30], ["created_at", "2021-04-28 20:08:02.375983"], ["updated_at", "2021-04-28 20:08:02.375983"]]

  def artist_albums
    name = params[:eartist]
    artist = Artist.find_by eartist: name
    if artist.nil?
      render json: "Not found", status: :not_found
    else
      if artist.albums.empty?
---
SELECT  1 AS one FROM "albums" WHERE "albums"."artist_id" = $1 LIMIT $2  [["artist_id", 12], ["LIMIT", 1]]

  def delete
    name = params[:eartist]
    @artist = Artist.find_by eartist: name
    if @artist.nil?
      render json: "No existe", status: :not_found
    else
      @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 13]]