app/controllers/artists_controller.rb

SELECT  1 AS one FROM "artists" LIMIT $1  [["LIMIT", 1]]
SELECT "artists".* FROM "artists"
---
  def index
    if Artist.all.empty?
      render json: Artist.all, status: :ok
    else
      artists = Artist.all.map{|c| c.index(request.host)}

SELECT  "artists".* FROM "artists" WHERE "artists"."eartist" = $1 LIMIT $2  [["eartist", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
---
  def show
    name = params[:eartist]
    artist = Artist.find_by eartist: name

SELECT  "artists".* FROM "artists" WHERE "artists"."name" = $1 LIMIT $2  [["name", "Michael Jackson"], ["LIMIT", 1]]
INSERT INTO "artists" ("eartist", "name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["eartist", "TWljaGFlbCBKYWNrc29u"], ["name", "Michael Jackson"], ["age", 21], ["created_at", "2021-04-29 09:35:08.246575"], ["updated_at", "2021-04-29 09:35:08.246575"]]
---
  def create



      if ((params[:artist].key?("name")) && (params[:artist].key?("age")) && (params[:artist].keys.length ==2 ))
      artist_params = params.require(:artist).permit(:name, :age)
      artist = Artist.new(artist_params)
      artist.encodeartist
      artist_exists = Artist.find_by name: artist.name
      if artist_exists.nil?
        if artist.save

SELECT  "artists".* FROM "artists" WHERE "artists"."eartist" = $1 LIMIT $2  [["eartist", "ZnJhbms="], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."eartist" = $1 LIMIT $2  [["eartist", "TWljaGFlbCBKYWNrc29ucw"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 14]]
---
  def artist_albums
    name = params[:eartist]
    artist = Artist.find_by eartist: name
    if artist.nil?
      render json: "Not found", status: :not_found
    else
      if artist.albums.nil?
        render json: "", status: :ok
      else
        render json: artist.albums.map{|c| c.index(request.host)}, status: :ok

SELECT  "artists".* FROM "artists" WHERE "artists"."eartist" = $1 LIMIT $2  [["eartist", "Y3Jpc3RpYW4="], ["LIMIT", 1]]
---
  def artist_play
    name = params[:eartist]
    artist = Artist.find_by eartist: name

SELECT  "artists".* FROM "artists" WHERE "artists"."eartist" = $1 LIMIT $2  [["eartist", "Y2h1ZW4="], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."artist_id" = $1  [["artist_id", 3]]
SELECT  "artists".* FROM "artists" WHERE "artists"."eartist" = $1 LIMIT $2  [["eartist", "Y2h1ZW5v"], ["LIMIT", 1]]
---
  def artist_tracks
    name = params[:eartist]
    artist = Artist.find_by eartist: name
    if artist.nil?
      render json: "Not found", status: :not_found
    else
      if artist.tracks.nil?
        render json: "No tiene tracks", status: :ok
      else
        render json: artist.tracks.map{|c| c.index(request.host)}, status: :ok

SELECT  "artists".* FROM "artists" WHERE "artists"."eartist" = $1 LIMIT $2  [["eartist", "TWljaGFlbCBKYWNrc29u"], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 1]]
---
  def delete
    name = params[:eartist]
    artist = Artist.find_by eartist: name
    if artist.nil?
      render json: "No existe", status: :not_found
    else
      artist.destroy