app/controllers/artists_controller.rb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."artist_id" = $1  [["artist_id", 1]]
---
  def artist_tracks
    name = params[:eartistid]
    artist = Artist.find_by eartist: name
    if artist.nil?
      render json: "Not found", status: :not_found
    else
      if artist.tracks.nil?
        render json: "No tiene tracks", status: :ok
      else
        render json: artist.tracks.map{|c| c.index(request.host)}, status: :ok