app/controllers/tracks_controller.rb

  def track_play
    name = params[:etrack]
    track = Track.find_by etrack: name
    if track.nil?
      render json: "No existe", status: :not_found
    else
      track.update(track.play_track)
---
UPDATE "tracks" SET "times_played" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["times_played", 1], ["updated_at", "2021-04-29 21:56:55.859447"], ["id", 3]]