app/controllers/tracks_controller.rb

  def index
    tracks = Track.all
    if Track.all.empty?
      render json: tracks, status: :ok
    else
      render json: tracks.map{|c| c.track_index(request.host)}, status: :ok
---
SELECT "tracks".* FROM "tracks"
SELECT  1 AS one FROM "tracks" LIMIT $1  [["LIMIT", 1]]

  def show
    name = params[:etrack]

    track = Track.find_by etrack: name
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."etrack" = $1 LIMIT $2  [["etrack", "unknown_id"], ["LIMIT", 1]]

  def track_play
    name = params[:etrack]
    track = Track.find_by etrack: name
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."etrack" = $1 LIMIT $2  [["etrack", "MiBhbGJ1bQ=="], ["LIMIT", 1]]

  def create
    if ((params[:track].key?("name")) && (params[:track].key?("duration")) && (params[:track].keys.length<=2 ))
      album_name = params[:ealbum]
      album = Album.find_by ealbum: album_name
      if album.nil?
        render json: "", status: :unprocessable_entity
      else
        @track_params = params.require(:track).permit(:name, :duration)
        @track_params[:album_id] = album.id
        @track_params[:artist_id] = album.artist.id
        @track_params["times_played"] = 0
        @track = Track.new(@track_params)
        @track.encodetrack
        track_exists = Track.find_by name: @track.name
        if track_exists.nil?
          if @track.save
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."name" = $1 LIMIT $2  [["name", "maquinon"], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."ealbum" = $1 LIMIT $2  [["ealbum", "Z2FuZ3N0ZXJz"], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."name" = $1 LIMIT $2  [["name", "gangmasters"], ["LIMIT", 1]]
INSERT INTO "tracks" ("etrack", "name", "duration", "times_played", "album_id", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def delete
    name = params[:etrack]
    track = Track.find_by etrack: name
    if track.nil?
      render json: "No existe", status: :not_found
    else
      track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."etrack" = $1 LIMIT $2  [["etrack", "MiBhbGJ1bQ=="], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 3]]