app/models/track.rb

  def play
    new_params = {times_played: times_played+1}
    self.update(new_params)
---
UPDATE "tracks" SET "times_played" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["times_played", 1], ["updated_at", "2021-04-29 21:56:55.859447"], ["id", 3]]